/*---------------------------------------------------------------------------------------------
 * Copyright (c) Microsoft Corporation. All rights reserved.
 * Licensed under the MIT License. See License.txt in the project root for license information.
 *---------------------------------------------------------------------------------------------*/
define("vs/base/common/worker/simpleWorker.nls.ja",{"vs/base/common/errors":["{0}。エラー コード: {1}","アクセス許可が拒否されました (HTTP {0})","アクセス許可が拒否されました","{0} (HTTP {1}: {2})","{0} (HTTP {1})","不明な接続エラー ({0})","不明な接続エラーが発生しました。インターネット接続が切れたか、接続先のサーバーがオフラインです。","{0}: {1}","不明なエラーが発生しました。ログで詳細を確認してください。","システム エラーが発生しました ({0})","不明なエラーが発生しました。ログで詳細を確認してください。","{0} (合計 {1} エラー)","不明なエラーが発生しました。ログで詳細を確認してください。","実装されていません","無効な引数: {0}","無効な引数","無効な状態: {0}","無効な状態","必要なファイルを読み込みに失敗しました。インターネット接続が切れたか、接続先のサーバーがオフラインです。ブラウザーを更新して、もう一度やり直してください。","必要なファイルの読み込みに失敗しました。アプリケーションを再起動してもう一度試してください。詳細: {0}"]});
//# sourceMappingURL=https://ticino.blob.core.windows.net/sourcemaps/fa6d0f03813dfb9df4589c30121e9fcffa8a8ec8/vs\base\common\worker\simpleWorker.nls.ja.js.map
