[
	"Описывает JSON-файл с использованием схемы. Дополнительные сведения см. на веб-сайте json-schema.org.",
	"Уникальный идентификатор для схемы.",
	"Схема, с использованием которой будет проверяться этот документ ",
	"Описательное название элемента",
	"Длинное описание элемента. Используется в меню, отображаемых при наведении, и предложениях.",
	"Значение по умолчанию. Используется предложениями.",
	"Число, которое должно разделять текущее значение без остатка",
	"Максимальное числовое значение, включенное по умолчанию.",
	"Делает максимальное свойство эксклюзивным.",
	"Минимальное числовое значение, включенное по умолчанию.",
	"Делает минимальное свойство эксклюзивным.",
	"Максимальная длина строки.",
	"Минимальная длина строки.",
	"Регулярное выражение, относительно которого сопоставляется строка. Оно не является неявно прикрепленным.",
	"Для массивов, только когда элементы заданы в виде массива. Если это схема, эта схема проверяет элементы после тех, которые заданы массивом элементов. Если значение равно false, дополнительные элементы вызывают сбой проверки.",
	"Для массивов. Может являться схемой, относительно которой проверяется каждый элемент, или массивом схем, относительно которого проверяется каждый элемент по порядку (первая схема проверяет первый элемент, вторая схема проверяет второй элемент и так далее).",
	"Максимальное число элементов, которые могут находиться внутри массива. Включительно.",
	"Минимальное число элементов, которые могут находиться внутри массива. Включительно.",
	"Если все элементы массива должны быть уникальными. По умолчанию имеет значение false.",
	"Максимальное число свойств, которыми может обладать объект. Включительно.",
	"Минимальное число свойств, которыми может обладать объект. Включительно.",
	"Массив строк, перечисляющий имена всех свойств, необходимых в этом объекте.",
	"Схема или логическое значение. Если это схема, она используется для проверки всех свойств, не сопоставленных с параметром \"properties\" или \"patternProperties\". Если значение равно false, любые свойства, не сопоставленные ни с одним из этих параметров, вызывают ошибку схемы.",
	"Не используется для проверки. Поместите сюда вложенные схемы, на которые требуется ссылаться в строке с помощью $ref",
	"Сопоставление имен свойств со схемами для каждого свойства.",
	"Сопоставление регулярных выражений в именах со свойствами схем для соответствующих свойств.",
	"Сопоставление имен свойств с массивом имен свойств или схеме. Массив имен свойств означает, что допустимость свойства, именованного в ключе, зависит от свойств массива, присутствующих в объекте. Если значение — схема, эта схема применима к объекту только в том случае, если свойство ключа существует в объекте.",
	"Набор допустимых значений литерала",
	"Строка одного из базовых типов схем (число, целое число, значение NULL, массив, объект, логическое значение, строка) или массив строк, задающий подмножество тех типов.",
	"Описание формата, ожидаемого для значения.",
	"Массив схем, все из которых должны соответствовать.",
	"Массив схем, хотя бы одна из которых должна соответствовать.",
	"Массив схем, из которых должна соответствовать только одна.",
	"Схема, которая не должна соответствовать."
]