[
	"Décrit un fichier JSON à l'aide d'un schéma. Pour plus d'informations, consultez json-schema.org.",
	"Identificateur unique du schéma.",
	"Schéma servant à la vérification de ce document ",
	"Titre descriptif de l'élément",
	"Description longue de l'élément. Utilisée dans les menus sensitifs et les suggestions.",
	"Valeur par défaut. Utilisée par les suggestions.",
	"Nombre qui doit diviser parfaitement la valeur actuelle (sans reste)",
	"Valeur numérique maximum, inclusive par défaut.",
	"Rend la propriété maximum exclusive.",
	"Valeur numérique minimum, inclusive par défaut.",
	"Rend la propriété minimum exclusive.",
	"Longueur maximum d'une chaîne.",
	"Longueur minimum d'une chaîne.",
	"Expression régulière à mettre en correspondance avec la chaîne. Elle n'est pas implicitement ancrée.",
	"Pour les tableaux, uniquement lorsque les éléments sont définis comme tableau. S'il s'agit d'un schéma, celui-ci valide les éléments après ceux spécifiés par le tableau d'éléments. Si la valeur est false, les éléments supplémentaires entraînent l'échec de la validation.",
	"Pour les tableaux. Peut être soit un schéma en fonction duquel valider chaque élément, soit un tableau de schémas en fonction duquel valider chaque élément dans l'ordre (le premier schéma valide le premier élément, le deuxième schéma valide le deuxième élément, etc.).",
	"Nombre maximum d'éléments pouvant figurer dans un tableau (inclusif).",
	"Nombre minimum d'éléments pouvant figurer dans un tableau (inclusif).",
	"Si tous les éléments du tableau doivent être uniques. La valeur par défaut est false.",
	"Nombre maximum de propriétés d'un objet (inclusif).",
	"Nombre minimum de propriétés d'un objet (inclusif).",
	"Tableau de chaînes qui répertorie les noms de toutes les propriétés nécessaires sur cet objet.",
	"Schéma ou booléen. S'il s'agit d'un schéma, il est utilisé pour valider toutes les propriétés non mises en correspondance par 'properties' ou 'patternProperties'. Si la valeur est false, les propriétés non mises en correspondance entraînent l'échec du schéma.",
	"Non utilisé pour la validation. Placez ici les sous-schémas que vous voulez référencer inline avec $ref",
	"Mappage des noms de propriétés aux schémas de chaque propriété.",
	"Mappage des expressions régulières sur les noms des propriétés aux schémas des propriétés correspondantes.",
	"Mappage des noms de propriétés à un tableau de noms de propriétés ou un schéma. Un tableau de noms de propriétés implique que la propriété nommée dans la clé dépend de la présence des propriétés du tableau dans l'objet pour être valide. Si la valeur est un schéma, celui-ci est uniquement appliqué à l'objet si la propriété dans la clé existe dans l'objet.",
	"Ensemble des valeurs littérales valides",
	"Chaîne d'un des types de schéma de base (nombre, entier, Null, tableau, objet, booléen ou chaîne) ou tableau de chaînes spécifiant un sous-ensemble de ces types.",
	"Décrit le format attendu pour la valeur.",
	"Tableau de schémas qui doivent tous correspondre.",
	"Tableau de schémas dont au moins un doit correspondre.",
	"Tableau de schémas, dont exactement un doit correspondre.",
	"Schéma qui ne doit pas correspondre."
]