[
	"Falscher Typ. Ein Typ von {0} wurde erwartet.",
	"Falscher Typ. Erwartet wurde \"{0}\".",
	"Stimmt mit einem unzulässigen Schema überein.",
	"Stimmt mit mehreren Schemas überein, obwohl nur ein Schema übereinstimmen darf.",
	"Der Wert ist kein zulässiger Wert. Gültige Werte: {0}",
	"Das Array enthält gemäß dem Schema zu viele Elemente. Es wurden höchstens {0} Argumente erwartet.",
	"Das Array enthält zu wenige Elemente. Es wurden mindestens {0} Argumente erwartet.",
	"Das Array enthält zu viele Elemente. Es wurden höchstens {0} Argumente erwartet.",
	"Das Array enthält doppelte Elemente.",
	"Der Wert ist nicht teilbar durch {0}.",
	"Der Wert liegt unter dem exklusiven Mindestwert von {0}.",
	"Der Wert liegt unter dem Mindestwert von {0}.",
	"Der Wert liegt über dem exklusiven Maximalwert von {0}.",
	"Der Wert liegt über dem Maximalwert von {0}",
	"Die Zeichenfolge ist kürzer als die minimale Länge von ",
	"Die Zeichenfolge ist kürzer als die maximale Länge von ",
	"Die Zeichenfolge stimmt nicht mit dem Muster \"{0}\" überein.",
	"Fehlende Eigenschaft \"{0}\".",
	"Die Eigenschaft \"{0}\" ist unzulässig.",
	"Das Objekt verfügt über mehr Eigenschaften als das Limit von {0}.",
	"Das Objekt verfügt über weniger Eigenschaften als die erforderliche Anzahl von {0}.",
	"Im Objekt fehlt die Eigenschaft \"{0}\", die für die Eigenschaft \"{1}\" erforderlich ist.",
	"Ungültige Unicode-Sequenz in der Zeichenfolge.",
	"Ungültiges Escapezeichen in Zeichenfolge",
	"Unerwartetes Ende der Zahl.",
	"Unerwartetes Kommentarende.",
	"Unerwartetes Ende der Zeichenfolge.",
	"Ein Wert wurde erwartet.",
	"Es wurde ein Komma oder eine schließende Klammer erwartet.",
	"Eigenschaftenschlüssel müssen in doppelte Anführungszeichen eingeschlossen werden.",
	"Doppelter Objektschlüssel",
	"Es wurde ein Doppelpunkt erwartet.",
	"Ein Wert wurde erwartet.",
	"Es wurde eine Eigenschaft erwartet.",
	"Es wurde ein Komma oder eine schließende geschweifte Klammer erwartet.",
	"Ungültiges Zahlenformat",
	"Ungültiges Zahlenformat",
	"Ein JSON-Objekt, Array oder Literal wurde erwartet.",
	"Das Dateiende wurde erwartet."
]